_posts/2022-01-03-boj-1744.html
---
title: BOJ 1744 수 묶기
tags: 그리디
---

<div id="outline-container-orgff1587c" class="outline-2">
<h2 id="orgff1587c">BOJ 1744 수 묶기</h2>
<div class="outline-text-2" id="text-orgff1587c">
<ul class="org-ul">
<li>수열에서 두 수를 묶어서 곱하거나, 묶지 않은 상태로 총합 구하기</li>
</ul>
</div>
</div>

<div id="outline-container-orgb64a6f3" class="outline-2">
<h2 id="orgb64a6f3">접근하기</h2>
<div class="outline-text-2" id="text-orgb64a6f3">
<pre class="example">
Case1
-1 0 1       -&gt; 음수와 0이 만나면 소거됨

Case2
-9 -2 0 1    -&gt; 음수 x 음수 = 양수  

Case3
1 3          -&gt;  1 x 양수 &lt; 1 + 양수 

max heap - 1보다 큰 수 저장 -&gt; 2개씩 꺼내서 곱하고, 남은 건 더하기
min heap - 음의 정수 저장   -&gt; 2개씩 꺼내서 곱하고, zero_cnt로 소거한 후,  남은 건 더하기(뺄셈효과)
zero_cnt - 0 개수 세기
one_cnt  - 1 개수 세기 -&gt; 마지막에 더하기
</pre>
</div>
</div>

<div id="outline-container-orgdf2115b" class="outline-2">
<h2 id="orgdf2115b">코드</h2>
<div class="outline-text-2" id="text-orgdf2115b">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #888a85;">// </span><span style="color: #888a85;">&#50577;&#49688; priority queue</span>
<span style="color: #888a85;">// </span><span style="color: #888a85;">&#51020;&#49688; priority queue</span>
<span style="color: #888a85;">// </span><span style="color: #888a85;">zero_cnt</span>
<span style="color: #888a85;">// </span><span style="color: #888a85;">one_cnt</span>

<span style="color: #8ae234; font-weight: bold;">priority_queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">plus_pq</span>; <span style="color: #888a85;">// </span><span style="color: #888a85;">max heap</span>
<span style="color: #8ae234; font-weight: bold;">priority_queue</span> &lt; <span style="color: #8ae234; font-weight: bold;">int</span>, <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt;, <span style="color: #8ae234; font-weight: bold;">greater</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; &gt; <span style="color: #ff6347;">minus_pq</span>; <span style="color: #888a85;">// </span><span style="color: #888a85;">min heap</span>
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">zero_cnt</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">one_cnt</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);

    zero_cnt = 0;
    one_cnt = 0;

    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ans</span> = 0;    
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>;
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;num);
        <span style="color: #729fcf; font-weight: bold;">if</span> (num == 0)
            zero_cnt += 1;
        <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (num == 1)
            one_cnt += 1;
        <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> ( num &gt; 1) {
            plus_pq.push(num);
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ret</span> = plus_pq.size();
            <span style="color: #888a85;">//</span><span style="color: #888a85;">printf("size : %d \n", ret);</span>
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> ( num &lt; 0) {
            minus_pq.push(num);
        }
    }

    <span style="color: #729fcf; font-weight: bold;">while</span>(minus_pq.size() &gt;= 2) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n1</span> = minus_pq.top(); minus_pq.pop();
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n2</span> = minus_pq.top(); minus_pq.pop();
        ans += (n1*n2);
    }
    <span style="color: #729fcf; font-weight: bold;">if</span> (minus_pq.size() == 1) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (zero_cnt &gt; 0) {
            zero_cnt--;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n1</span> = minus_pq.top(); minus_pq.pop();
            ans += n1;
        }
    }

    <span style="color: #729fcf; font-weight: bold;">while</span>(plus_pq.size() &gt;= 2) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n1</span> = plus_pq.top(); plus_pq.pop();
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n2</span> = plus_pq.top(); plus_pq.pop();
         ans += (n1*n2);
    }
    <span style="color: #729fcf; font-weight: bold;">if</span> (plus_pq.size() == 1) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">n1</span> = plus_pq.top(); plus_pq.pop();
        ans += n1;
    }
    ans += one_cnt;

    printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ans);
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge63c2aa" class="outline-2">
<h2 id="orge63c2aa">문제 링크</h2>
<div class="outline-text-2" id="text-orge63c2aa">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/1744">https://www.acmicpc.net/problem/1744</a></li>
</ul>
</div>
</div>
